Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128.atdf
        <register caption="Interrupt Disable Register" name="AES_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Disable" mask="0x00010000" name="TAGRDY"/>
          <bitfield caption="End of Padding Interrupt Disable" mask="0x00020000" name="EOPAD"/>
          <bitfield caption="Padding Length Error Interrupt Disable" mask="0x00040000" name="PLENERR"/>
          <bitfield caption="Security and/or Safety Event Interrupt Disable" mask="0x00080000" name="SECE"/>
        </register>
        <register caption="Interrupt Mask Register" name="AES_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Mask" mask="0x00010000" name="TAGRDY"/>
          <bitfield caption="End of Padding Interrupt Mask" mask="0x00020000" name="EOPAD"/>
          <bitfield caption="Padding Length Error Interrupt Mask" mask="0x00040000" name="PLENERR"/>
          <bitfield caption="Security and/or Safety Event Interrupt Mask" mask="0x00080000" name="SECE"/>
        </register>
        <register caption="Interrupt Status Register" name="AES_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of RX Buffer (cleared by writing AES_RCR or AES_RNCR)" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of TX Buffer (cleared by writing AES_TCR or AES_TNCR)" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="RX Buffer Full (cleared by writing AES_RCR or AES_RNCR)" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty (cleared by writing AES_TCR or AES_TNCR)" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR)" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access (cleared by writing SWRST in AES_CR)" mask="0x0000F000" name="URAT" values="AES_ISR__URAT"/>
          <bitfield caption="GCM Tag Ready" mask="0x00010000" name="TAGRDY"/>
          <bitfield caption="End of Padding" mask="0x00020000" name="EOPAD"/>
          <bitfield caption="Padding Length Error" mask="0x00040000" name="PLENERR"/>
          <bitfield caption="Security and/or Safety Event (cleared on read)" mask="0x00080000" name="SECE"/>
        </register>
        <register caption="Key Word Register" name="AES_KEYWR" offset="0x20" rw="W" size="4" count="8">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Input Data Register" name="AES_IDATAR" offset="0x40" rw="W" size="4" count="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Output Data Register" name="AES_ODATAR" offset="0x50" rw="R" size="4" count="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Initialization Vector Register" name="AES_IVR" offset="0x60" rw="W" size="4" count="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Additional Authenticated Data Length Register" name="AES_AADLENR" offset="0x70" rw="RW" size="4">
          <bitfield caption="Additional Authenticated Data Length" mask="0xFFFFFFFF" name="AADLEN"/>
        </register>
        <register caption="Plaintext/Ciphertext Length Register" name="AES_CLENR" offset="0x74" rw="RW" size="4">
          <bitfield caption="Plaintext/Ciphertext Length" mask="0xFFFFFFFF" name="CLEN"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register" name="AES_GHASHR" offset="0x78" rw="RW" size="4" count="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
        <register caption="GCM Authentication Tag Word Register" name="AES_TAGR" offset="0x88" rw="R" size="4" count="4">
          <bitfield caption="GCM Authentication Tag x" mask="0xFFFFFFFF" name="TAG"/>
        </register>
        <register caption="GCM Encryption Counter Value Register" name="AES_CTRR" offset="0x98" rw="R" size="4">
          <bitfield caption="GCM Encryption Counter" mask="0xFFFFFFFF" name="CTR"/>
        </register>
        <register caption="GCM H Word Register" name="AES_GCMHR" offset="0x9C" rw="RW" size="4" count="4">
          <bitfield caption="GCM H Word x" mask="0xFFFFFFFF" name="H"/>
        </register>
        <register caption="Extended Mode Register" name="AES_EMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Auto Padding Enable" mask="0x00000001" name="APEN"/>
          <bitfield caption="Auto Padding Mode" mask="0x00000002" name="APM"/>
          <bitfield caption="Key Selection" mask="0x00000004" name="KSEL"/>
          <bitfield caption="Protocol Layer Improved Performance Enable" mask="0x00000010" name="PLIPEN"/>
          <bitfield caption="Protocol Layer Improved Performance Decipher" mask="0x00000020" name="PLIPD"/>
          <bitfield caption="Private Key Write Lock" mask="0x00000040" name="PKWL"/>
          <bitfield caption="Private Key Internal Register Select" mask="0x00000080" name="PKRS"/>
          <bitfield caption="Auto Padding Length" mask="0x0000FF00" name="PADLEN"/>
          <bitfield caption="IPSec Next Header" mask="0x00FF0000" name="NHEAD"/>
          <bitfield caption="Encryption Algorithm" mask="0x01000000" name="ALGO" values="AES_EMR__ALGO"/>
          <bitfield caption="Block Processing End" mask="0x80000000" name="BPE"/>
        </register>
        <register caption="Byte Counter Register" name="AES_BCNT" offset="0xB4" rw="RW" size="4">
          <bitfield caption="Auto Padding Byte Counter" mask="0xFFFFFFFF" name="BCNT"/>
        </register>
        <register caption="Write Protection Mode Register" name="AES_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interruption Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="First Error Report Enable" mask="0x00000010" name="FIRSTE"/>
          <bitfield caption="Action on Abnormal Event Detection" mask="0x000000E0" name="ACTION" values="AES_WPMR__ACTION"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="AES_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="AES_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Clock Glitch Detected (cleared on read)" mask="0x00000002" name="CGD"/>
          <bitfield caption="Internal Sequencer Error (cleared on read)" mask="0x00000004" name="SEQE"/>
          <bitfield caption="Software Control Error (cleared on read)" mask="0x00000008" name="SWE"/>
          <bitfield caption="Private Key Internal Register Protection Violation Status (cleared on read)" mask="0x00000010" name="PKRPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
          <bitfield caption="Software Error Type (cleared on read)" mask="0x0F000000" name="SWETYP" values="AES_WPSR__SWETYP"/>
          <bitfield caption="Software Error Class (cleared on read)" mask="0x80000000" name="ECLASS" values="AES_WPSR__ECLASS"/>
        </register>
