Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128.atdf
        <register caption="Receive Pointer Register" name="AES_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="AES_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="AES_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="AES_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="AES_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="AES_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="AES_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="AES_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="AES_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="AES_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="AES_PWPMR" offset="0x128" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="AES_PWPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Dual Input Buffer" name="AES_MR__DUALBUFF">
        <value caption="AES_IDATARx cannot be written during processing of previous block." name="INACTIVE" value="0"/>
        <value caption="AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files." name="ACTIVE" value="1"/>
      </value-group>
      <value-group caption="Start Mode" name="AES_MR__SMOD">
        <value caption="Manual Mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto Mode" name="AUTO_START" value="0x1"/>
        <value caption="AES_IDATAR0 access only Auto Mode (PDC)" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="Key Size" name="AES_MR__KEYSIZE">
        <value caption="AES Key Size is 128 bits" name="AES128" value="0x0"/>
        <value caption="AES Key Size is 192 bits" name="AES192" value="0x1"/>
        <value caption="AES Key Size is 256 bits" name="AES256" value="0x2"/>
      </value-group>
      <value-group caption="Operating Mode" name="AES_MR__OPMOD">
        <value caption="ECB: Electronic Codebook mode" name="ECB" value="0x0"/>
        <value caption="CBC: Cipher Block Chaining mode" name="CBC" value="0x1"/>
        <value caption="OFB: Output Feedback mode" name="OFB" value="0x2"/>
        <value caption="CFB: Cipher Feedback mode" name="CFB" value="0x3"/>
        <value caption="CTR: Counter mode (16-bit internal counter)" name="CTR" value="0x4"/>
        <value caption="GCM: Galois/Counter mode" name="GCM" value="0x5"/>
      </value-group>
      <value-group caption="Cipher Feedback Data Size" name="AES_MR__CFBS">
        <value caption="128-bit" name="SIZE_128BIT" value="0x0"/>
        <value caption="64-bit" name="SIZE_64BIT" value="0x1"/>
        <value caption="32-bit" name="SIZE_32BIT" value="0x2"/>
        <value caption="16-bit" name="SIZE_16BIT" value="0x3"/>
        <value caption="8-bit" name="SIZE_8BIT" value="0x4"/>
      </value-group>
      <value-group caption="Key" name="AES_MR__CKEY">
        <value caption="This field must be written with 0xE the first time AES_MR is programmed. For subsequent programming of AES_MR, any value can be written, including that of 0xE. Always reads as 0." name="PASSWD" value="0xE"/>
      </value-group>
      <value-group caption="Unspecified Register Access (cleared by writing SWRST in AES_CR)" name="AES_ISR__URAT">
        <value caption="Input Data register written during the data processing when SMOD = 2 mode." name="IDR_WR_PROCESSING" value="0x0"/>
        <value caption="Output Data register read during the data processing." name="ODR_RD_PROCESSING" value="0x1"/>
        <value caption="Mode register written during the data processing." name="MR_WR_PROCESSING" value="0x2"/>
        <value caption="Output Data register read during the sub-keys generation." name="ODR_RD_SUBKGEN" value="0x3"/>
        <value caption="Mode register written during the sub-keys generation." name="MR_WR_SUBKGEN" value="0x4"/>
        <value caption="Write-only register read access." name="WOR_RD_ACCESS" value="0x5"/>
      </value-group>
      <value-group caption="Encryption Algorithm" name="AES_EMR__ALGO">
        <value caption="The AES algorithm is used for encryption." name="AES" value="0"/>
        <value caption="The ARIA algorithm is used for encryption." name="ARIA" value="1"/>
      </value-group>
      <value-group caption="Action on Abnormal Event Detection" name="AES_WPMR__ACTION">
        <value caption="No action (stop or clear key) is performed when one of PKRPVS, WPVS, CGD, SEQE, or SWE flags is set." name="REPORT_ONLY" value="0x0"/>
        <value caption="If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued." name="LOCK_PKRPVS_WPVS_SWE" value="0x1"/>
        <value caption="If a processing is in progress when the AES_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued." name="LOCK_CGD_SEQE" value="0x2"/>
        <value caption="If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued." name="LOCK_ANY_EV" value="0x3"/>
        <value caption="If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued. Moreover, the AES_KEYWRx key is immediately cleared." name="CLEAR_PKRPVS_WPVS_SWE" value="0x4"/>
        <value caption="If a processing is in progress when the AES_WPSR.CGD/SEQE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued. Moreover, the AES_KEYWRx key is immediately cleared." name="CLEAR_CGD_SEQE" value="0x5"/>
        <value caption="If a processing is in progress when the AES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AES_CR.UNLOCK command is issued. Moreover, the AES_KEYWRx key is immediately cleared." name="CLEAR_ANY_EV" value="0x6"/>
      </value-group>
