Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128.atdf
      <value-group caption="PIO Line 14 Mask" name="PIO_P_MSKR0__MSK14">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 15 Mask" name="PIO_P_MSKR0__MSK15">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 16 Mask" name="PIO_P_MSKR0__MSK16">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 17 Mask" name="PIO_P_MSKR0__MSK17">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 18 Mask" name="PIO_P_MSKR0__MSK18">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 19 Mask" name="PIO_P_MSKR0__MSK19">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 20 Mask" name="PIO_P_MSKR0__MSK20">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 21 Mask" name="PIO_P_MSKR0__MSK21">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 22 Mask" name="PIO_P_MSKR0__MSK22">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 23 Mask" name="PIO_P_MSKR0__MSK23">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 24 Mask" name="PIO_P_MSKR0__MSK24">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 25 Mask" name="PIO_P_MSKR0__MSK25">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 26 Mask" name="PIO_P_MSKR0__MSK26">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 27 Mask" name="PIO_P_MSKR0__MSK27">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 28 Mask" name="PIO_P_MSKR0__MSK28">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 29 Mask" name="PIO_P_MSKR0__MSK29">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 30 Mask" name="PIO_P_MSKR0__MSK30">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 31 Mask" name="PIO_P_MSKR0__MSK31">
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
