Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128.atdf
      <value-group caption="System Reset Key" name="RSTC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="Reset Type" name="RSTC_SR__RSTTYP">
        <value caption="First power-up reset, Core and VDD3V3 Supply Monitor if not a PORVDD3V3 reset" name="GENERAL_RST" value="0x0"/>
        <value caption="VDDCORE reset. Wake-up from Backup mode" name="BACKUP_RST" value="0x1"/>
        <value caption="Watchdog 0 fault occurred" name="WDT0_RST" value="0x2"/>
        <value caption="Processor reset required by the software" name="SOFT_RST" value="0x3"/>
        <value caption="NRST pin detected low" name="USER_RST" value="0x4"/>
        <value caption="Core Supply Monitor reset" name="CORE_SM_RST" value="0x5"/>
        <value caption="CPU clock failure detection occurred" name="CPU_FAIL_RST" value="0x6"/>
        <value caption="32.768 kHz crystal failure detection fault occurred" name="SLCK_XTAL_RST" value="0x7"/>
        <value caption="Watchdog 1 fault occurred" name="WDT1_RST" value="0x9"/>
        <value caption="VDD3V3 PORVDD3V3 reset occurred" name="PORVDD3V3_RST" value="0xA"/>
      </value-group>
      <value-group caption="Backup Area Power Switch Control" name="RSTC_MR__PWRSW">
        <value caption="VDDBU is supplied by VDD3V3" name="VDD3V3" value="0x0"/>
        <value caption="VDDBU is supplied by VBAT" name="VBAT" value="0x1"/>
      </value-group>
      <value-group caption="Write Access Password" name="RSTC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module caption="Real-time Clock" name="RTC" id="04575" version="G">
      <register-group name="RTC_SUB0" size="16">
        <register caption="First Stamping Time Register of Source 0" name="RTC_FSTR" offset="0x0" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="UTC_MODE"/>
          <bitfield caption="Seconds of the Tamper (cleared by reading RTC_LSDRx)" mask="0x0000007F" name="SEC" modes="DEFAULT"/>
          <bitfield caption="Minutes of the Tamper (cleared by reading RTC_LSDRx)" mask="0x00007F00" name="MIN" modes="DEFAULT"/>
          <bitfield caption="Hours of the Tamper (cleared by reading RTC_LSDRx)" mask="0x003F0000" name="HOUR" modes="DEFAULT"/>
          <bitfield caption="AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)" mask="0x00400000" name="AMPM" modes="DEFAULT"/>
          <bitfield caption="Tamper Events Counter (cleared by reading RTC_LSDRx)" mask="0x0F000000" name="TEVCNT" modes="DEFAULT"/>
          <bitfield caption="System Mode of the Tamper (cleared by reading RTC_LSDRx)" mask="0x80000000" name="BACKUP" modes="DEFAULT"/>
          <bitfield caption="Tamper Events Counter (cleared by reading RTC_LSDRx)" mask="0x0F000000" name="TEVCNT" modes="UTC_MODE"/>
          <bitfield caption="System Mode of the Tamper (cleared by reading RTC_LSDRx)" mask="0x80000000" name="BACKUP" modes="UTC_MODE"/>
        </register>
        <register caption="First Stamping Date Register of Source 0" name="RTC_FSDR" offset="0x4" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="UTC_MODE"/>
          <bitfield caption="Century of the Tamper (cleared by reading RTC_LSDRx)" mask="0x0000007F" name="CENT" modes="DEFAULT"/>
          <bitfield caption="Year of the Tamper (cleared by reading RTC_LSDRx)" mask="0x00007F00" name="YEAR" modes="DEFAULT"/>
          <bitfield caption="Month of the Tamper (cleared by reading RTC_LSDRx)" mask="0x001F0000" name="MONTH" modes="DEFAULT"/>
          <bitfield caption="Day of the Tamper (cleared by reading RTC_LSDRx)" mask="0x00E00000" name="DAY" modes="DEFAULT"/>
          <bitfield caption="Date of the Tamper (cleared by reading RTC_LSDRx)" mask="0x3F000000" name="DATE" modes="DEFAULT"/>
          <bitfield caption="Time of the Tamper (cleared by reading RTC_LSDRx)" mask="0xFFFFFFFF" name="UTC_TIME" modes="UTC_MODE"/>
        </register>
        <register caption="Last Stamping Time Register of Source 0" name="RTC_LSTR" offset="0x8" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="UTC_MODE"/>
          <bitfield caption="Seconds of the Tamper (cleared by reading RTC_LSDRx)" mask="0x0000007F" name="SEC" modes="DEFAULT"/>
          <bitfield caption="Minutes of the Tamper (cleared by reading RTC_LSDRx)" mask="0x00007F00" name="MIN" modes="DEFAULT"/>
          <bitfield caption="Hours of the Tamper (cleared by reading RTC_LSDRx)" mask="0x003F0000" name="HOUR" modes="DEFAULT"/>
          <bitfield caption="AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)" mask="0x00400000" name="AMPM" modes="DEFAULT"/>
          <bitfield caption="System Mode of the Tamper (cleared by reading RTC_LSDRx)" mask="0x80000000" name="BACKUP" modes="DEFAULT"/>
          <bitfield caption="System Mode of the Tamper (cleared by reading RTC_LSDRx)" mask="0x80000000" name="BACKUP" modes="UTC_MODE"/>
        </register>
        <register caption="Last Stamping Date Register of Source 0" name="RTC_LSDR" offset="0xC" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="UTC_MODE"/>
          <bitfield caption="Century of the Tamper (cleared on read)" mask="0x0000007F" name="CENT" modes="DEFAULT"/>
          <bitfield caption="Year of the Tamper (cleared on read)" mask="0x00007F00" name="YEAR" modes="DEFAULT"/>
          <bitfield caption="Month of the Tamper (cleared on read)" mask="0x001F0000" name="MONTH" modes="DEFAULT"/>
          <bitfield caption="Day of the Tamper (cleared on read)" mask="0x00E00000" name="DAY" modes="DEFAULT"/>
          <bitfield caption="Date of the Tamper (cleared on read)" mask="0x3F000000" name="DATE" modes="DEFAULT"/>
          <bitfield caption="Time of the Tamper (cleared on read)" mask="0xFFFFFFFF" name="UTC_TIME" modes="UTC_MODE"/>
        </register>
      </register-group>
      <register-group name="RTC">
        <register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM" values="RTC_CR__UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL" values="RTC_CR__UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD" values="RTC_MR__HRMOD"/>
          <bitfield caption="PERSIAN Calendar" mask="0x00000002" name="PERSIAN" values="RTC_MR__PERSIAN"/>
          <bitfield caption="UTC Time Format" mask="0x00000004" name="UTC" values="RTC_MR__UTC"/>
          <bitfield caption="NEGative PPM Correction" mask="0x00000010" name="NEGPPM" values="RTC_MR__NEGPPM"/>
          <bitfield caption="Slow Clock Correction" mask="0x00007F00" name="CORRECTION"/>
          <bitfield caption="HIGH PPM Correction" mask="0x00008000" name="HIGHPPM" values="RTC_MR__HIGHPPM"/>
          <bitfield caption="RTCOUT0 OutputSource Selection" mask="0x00070000" name="OUT0" values="RTC_MR__OUT0"/>
          <bitfield caption="RTCOUT1 Output Source Selection" mask="0x00700000" name="OUT1" values="RTC_MR__OUT1"/>
          <bitfield caption="High Duration of the Output Pulse" mask="0x07000000" name="THIGH" values="RTC_MR__THIGH"/>
          <bitfield caption="Period of the Output Pulse" mask="0x30000000" name="TPERIOD" values="RTC_MR__TPERIOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <mode name="DEFAULT"/>
          <mode name="UTC_MODE"/>
          <bitfield caption="Current Second" mask="0x0000007F" name="SEC" modes="DEFAULT"/>
          <bitfield caption="Current Minute" mask="0x00007F00" name="MIN" modes="DEFAULT"/>
          <bitfield caption="Current Hour" mask="0x003F0000" name="HOUR" modes="DEFAULT"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" name="AMPM" values="RTC_TIMR__AMPM" modes="DEFAULT"/>
          <bitfield caption="Current UTC Time" mask="0xFFFFFFFF" name="UTC_TIME" modes="UTC_MODE"/>
        </register>
