Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128.atdf
        <register caption="Core Debug Configuration Register" name="SFR_CORE_DEBUG_CFG" offset="0xA0" rw="RW" size="4">
          <bitfield caption="SWV Selection" mask="0x00000001" name="SWV"/>
          <bitfield caption="From Core 1 to Core 0 Cross Triggering" mask="0x00000002" name="XTRG1"/>
          <bitfield caption="From Core 0 to Core 1 Cross Triggering" mask="0x00000004" name="XTRG0"/>
        </register>
        <register caption="AHB2AHB Configuration Register" name="SFR_EMAHB2AHB" offset="0xA4" rw="RW" size="4">
          <bitfield caption="AHB MASTER0_1 Converter Prefetch" mask="0x00000001" name="PFETCH8_0_1" values="SFR_EMAHB2AHB__PFETCH8_0_1"/>
          <bitfield caption="AHB MASTER1_0 Converter Prefetch" mask="0x00000002" name="PFETCH8_1_0" values="SFR_EMAHB2AHB__PFETCH8_1_0"/>
        </register>
        <register caption="Secure Register" name="SFR_SECURE" offset="0xA8" rw="RW" size="4">
          <bitfield caption="ROM Access Enable" mask="0x00000001" name="ROM_ENA"/>
        </register>
        <register caption="Secure Bit Register" name="SFR_SECURE_BIT" offset="0xAC" rw="R" size="4">
          <bitfield caption="Secure Mode" mask="0x00000001" name="MODE_DIS"/>
        </register>
        <register caption="Erase Flash/SRAM Register" name="SFR_ERASE_FLASH_SRAM" offset="0xB0" rw="RW" size="4">
          <bitfield caption="PB2/Peripherals or Hardware Erase Signal Assignment" mask="0x00000001" name="HW_ERASE" values="SFR_ERASE_FLASH_SRAM__HW_ERASE"/>
          <bitfield caption="Erase SRAM0 Content" mask="0x00000002" name="SRAM0" values="SFR_ERASE_FLASH_SRAM__SRAM0"/>
        </register>
        <register caption="PWM Debug Register" name="SFR_PWM_DEBUG" offset="0xB4" rw="RW" size="4">
          <bitfield caption="Debug Information Propagation Mode" mask="0x00000001" name="CORE0" values="SFR_PWM_DEBUG__CORE0"/>
          <bitfield caption="Debug Information Propagation Mode" mask="0x00000002" name="CORE1" values="SFR_PWM_DEBUG__CORE1"/>
        </register>
        <register caption="FFPI Register" name="SFR_FFPI" offset="0xB8" rw="R" size="4">
          <bitfield caption="FFPI Status" mask="0x00000001" name="MODE"/>
        </register>
        <register caption="Improved Wait Mode Register" name="SFR_WAIT_MODE" offset="0xBC" rw="RW" size="4">
          <bitfield caption="Improved Wait Mode Control" mask="0x00000001" name="CONTROL"/>
        </register>
        <register caption="ROM Code Register" name="SFR_ROM_CODE" offset="0xC0" rw="R" size="4">
          <bitfield caption="PLLA Status" mask="0x00000003" name="PLLA_STATUS"/>
          <bitfield caption="" mask="0x00000004" name="FORCE_BYPASS"/>
          <bitfield caption="" mask="0x00000008" name="FORCE_BYPASS_VALUE"/>
        </register>
        <register caption="Write Protection Mode Register" name="SFR_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SFR_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SFR_WPSR" offset="0xE8" rw="RW" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Source" mask="0x00FFFF00" name="WPSRC"/>
        </register>
        <register caption="Spare Register" name="SFR_SPARE" offset="0xF0" rw="RW" size="4">
          <bitfield caption="Spare" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="Version Register" name="SFR_VERSION" offset="0xFC" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
      <value-group caption="AHB MASTER0_1 Converter Prefetch" name="SFR_EMAHB2AHB__PFETCH8_0_1">
        <value caption="INCR undefined burst converted to burst of 4 data." name="INCR4" value="0"/>
        <value caption="INCR undefined burst converted to burst of 8 data." name="INCR8" value="1"/>
      </value-group>
      <value-group caption="AHB MASTER1_0 Converter Prefetch" name="SFR_EMAHB2AHB__PFETCH8_1_0">
        <value caption="INCR undefined burst converted to burst of 4 data." name="INCR4" value="0"/>
        <value caption="INCR undefined burst converted to burst of 8 data." name="INCR8" value="1"/>
      </value-group>
      <value-group caption="PB2/Peripherals or Hardware Erase Signal Assignment" name="SFR_ERASE_FLASH_SRAM__HW_ERASE">
        <value caption="Hardware erase signal disabled. PB2 pin can be used in GPIO or Peripheral IO mode." name="DISABLE" value="0"/>
        <value caption="Hardware erase signal enabled. PB2 pin is assigned to Flash erase function." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Erase SRAM0 Content" name="SFR_ERASE_FLASH_SRAM__SRAM0">
        <value caption="If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is not deleted." name="NOT_DELETED" value="0"/>
        <value caption="If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is deleted." name="DELETED" value="1"/>
      </value-group>
      <value-group caption="Debug Information Propagation Mode" name="SFR_PWM_DEBUG__CORE0">
        <value caption="Core x does not send the debug signal to the PWM." name="NOT_SENT" value="0"/>
        <value caption="Core x sends the debug signal to PWM. Refer to &quot;Debug Mode&quot; in the section &quot;Pulse Width Modulation Controller (PWM)&quot; for details on configuring an action when the debug signal is active." name="SENT" value="1"/>
      </value-group>
      <value-group caption="Debug Information Propagation Mode" name="SFR_PWM_DEBUG__CORE1">
        <value caption="Core x does not send the debug signal to the PWM." name="NOT_SENT" value="0"/>
        <value caption="Core x sends the debug signal to PWM. Refer to &quot;Debug Mode&quot; in the section &quot;Pulse Width Modulation Controller (PWM)&quot; for details on configuring an action when the debug signal is active." name="SENT" value="1"/>
      </value-group>
