Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128.atdf
      <value-group caption="Burst Signal Selection" name="TC_CMR__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="External Event Edge Selection" name="TC_CMR__EEVTEDG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Selection" name="TC_CMR__EEVT">
        <value caption="TIOB" name="TIOB" value="0x0"/>
        <value caption="XC0" name="XC0" value="0x1"/>
        <value caption="XC1" name="XC1" value="0x2"/>
        <value caption="XC2" name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="Waveform Selection" name="TC_CMR__WAVSEL">
        <value caption="UP mode without automatic trigger on RC Compare" name="UP" value="0x0"/>
        <value caption="UPDOWN mode without automatic trigger on RC Compare" name="UPDOWN" value="0x1"/>
        <value caption="UP mode with automatic trigger on RC Compare" name="UP_RC" value="0x2"/>
        <value caption="UPDOWN mode with automatic trigger on RC Compare" name="UPDOWN_RC" value="0x3"/>
      </value-group>
      <value-group caption="RA Compare Effect on TIOAx" name="TC_CMR__ACPA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RC Compare Effect on TIOAx" name="TC_CMR__ACPC">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Effect on TIOAx" name="TC_CMR__AEEVT">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Software Trigger Effect on TIOAx" name="TC_CMR__ASWTRG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RB Compare Effect on TIOBx" name="TC_CMR__BCPB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RC Compare Effect on TIOBx" name="TC_CMR__BCPC">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Effect on TIOBx" name="TC_CMR__BEEVT">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Software Trigger Effect on TIOBx" name="TC_CMR__BSWTRG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Trigger Source for Input A" name="TC_EMR0__TRIGSRCA">
        <value caption="The trigger/capture input A is driven by external pin TIOAx" name="EXTERNAL_TIOAx" value="0"/>
        <value caption="The trigger/capture input A is driven internally by PWMx" name="PWMx" value="1"/>
      </value-group>
      <value-group caption="Trigger Source for Input B" name="TC_EMR0__TRIGSRCB">
        <value caption="The trigger/capture input B is driven by external pin TIOBx" name="EXTERNAL_TIOBx" value="0"/>
        <value caption="The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx." name="PWMx" value="1"/>
      </value-group>
      <value-group caption="Software Error Type (cleared on read)" name="TC_SSR0__SWETYP">
        <value caption="TC Channel x is enabled and a write-only register has been read (Warning)." name="READ_WO" value="0x0"/>
        <value caption="TC Channel x is enabled and a write access has been performed on a read-only register (Warning)." name="WRITE_RO" value="0x1"/>
        <value caption="Access to an undefined address of the TC (Warning)." name="UNDEF_RW" value="0x2"/>
        <value caption="TC_RAx or TC_RBx are written while channel is enabled and configured in capture mode (Error)." name="W_RARB_CAPT" value="0x3"/>
      </value-group>
      <value-group caption="Software Error Class" name="TC_SSR0__ECLASS">
        <value caption="An abnormal access that does not have any impact." name="WARNING" value="0"/>
        <value caption="An abnormal access that may have an impact." name="ERROR" value="1"/>
      </value-group>
      <value-group caption="External Clock Signal 0 Selection" name="TC_BMR__TC0XC0S">
        <value caption="Signal connected to XC0: TCLK0" name="TCLK0" value="0x0"/>
        <value caption="Signal connected to XC0: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC0: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="External Clock Signal 1 Selection" name="TC_BMR__TC1XC1S">
        <value caption="Signal connected to XC1: TCLK1" name="TCLK1" value="0x0"/>
        <value caption="Signal connected to XC1: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC1: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="External Clock Signal 2 Selection" name="TC_BMR__TC2XC2S">
        <value caption="Signal connected to XC2: TCLK2" name="TCLK2" value="0x0"/>
        <value caption="Signal connected to XC2: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC2: TIOA1" name="TIOA1" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="TC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x54494D"/>
      </value-group>
      <value-group caption="Write Protection Key" name="TC_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
    </module>
    <module caption="True Random Number Generator" name="TRNG" id="6334" version="S">
      <register-group name="TRNG">
        <register caption="Control Register" name="TRNG_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Enable TRNG to Provide Random Values" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Register Write Access Key" mask="0xFFFFFF00" name="WAKEY" values="TRNG_CR__WAKEY"/>
        </register>
        <register caption="Mode Register" name="TRNG_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Half Rate Enable" mask="0x00000001" name="HALFR" values="TRNG_MR__HALFR"/>
        </register>
        <register caption="Private Key Bus Control Register" name="TRNG_PKBCR" offset="0x08" rw="W" size="4">
          <bitfield caption="Key ID (Must be Always Written to 0)" mask="0x00000001" name="KID"/>
          <bitfield caption="Key Bus Client" mask="0x00000030" name="KSLAVE" values="TRNG_PKBCR__KSLAVE"/>
          <bitfield caption="Key Length" mask="0x0000FF00" name="KLENGTH"/>
          <bitfield caption="Register Write Access Key" mask="0xFFFF0000" name="WAKEY" values="TRNG_PKBCR__WAKEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="TRNG_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Security and/or Safety Event Interrupt Enable" mask="0x00000002" name="SECE"/>
          <bitfield caption="End Of Transfer on Private Key Bus Interrupt Enable" mask="0x00000004" name="EOTPKB"/>
        </register>
        <register caption="Interrupt Disable Register" name="TRNG_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Security and/or Safety Event Interrupt Disable" mask="0x00000002" name="SECE"/>
          <bitfield caption="End Of Transfer on Private Key Bus Interrupt Disable" mask="0x00000004" name="EOTPKB"/>
        </register>
